{"name":"Alex Johnson","phone":"","description":"I build frontend platforms and tools that make complex information simple and help engineers move faster. Over 8 years, I have focused on React and TypeScript, designing component libraries, robust state management, and performant data visualizations that surface real-time insights. I am comfortable designing and consuming GraphQL APIs to enable predictable, type-safe data flows, and I care deeply about usability, accessibility, and clear interfaces that accelerate decision-making. My work spans developer productivity dashboards, internal tooling, and user-facing features where reliable testing, observability, and performance are first-class concerns. I enjoy turning loosely defined problems into well-scoped solutions, collaborating closely with product, design, and backend teams to iterate quickly and ship impactful improvements. I value documentation, automated quality gates, and CI/CD practices that keep teams confident and fast.\nI operate well in cross-functional environments: I facilitate scope, estimation, and prioritization, aligning technical choices with product goals and timelines. I lead design and code reviews that focus on clarity, maintainability, and correctness, and I maintain documentation that makes platforms easy to adopt. I mentor earlier-career engineers by pairing, giving structured feedback, and sharing context so they can deliver independently. I’m comfortable with ambiguity and can explore options, propose trade-offs, and drive a path forward when requirements evolve. I maintain a product mindset—measuring outcomes, instrumenting features to learn from real usage, and using metrics to guide iteration. I champion testing strategies with unit and integration coverage (Jest, Cypress) and stay current with modern tools such as Playwright, adopting them where they reduce flakiness or improve speed. I care about accessibility (WCAG) and performance budgets, using profiling and monitoring to catch regressions early. When needed, I can flex into BFF/GraphQL schema work alongside backend partners to keep the frontend unblocked. Above all, I communicate clearly, document decisions, and seek feedback early so the team can deliver reliable, intuitive experiences that make engineers more effective every day.","email":"alex.johnson.dev@example.com","linkedin":"alex-johnson","linkedin_url":"https://www.linkedin.com/in/alex-johnson","github":"alexjohnson","github_url":"https://github.com/alexjohnson","educations":[{"institution":"Tech University","location":"Minsk, Belarus","degree":"Bachelor in Computer Science","duration":"2014 - 2018"},{"institution":"Tech University","location":"Minsk, Belarus","degree":"Master in Computer Science","duration":"2018 - 2020"}],"experiences":[{"title":"Senior Frontend Engineer","duration":"08.2025 - Present","company":"NovaWeb Solutions (Internal Platform)","location":"Remote, Warsaw, Poland","descriptions":["Delivered engineering-productivity dashboards and tooling in React + TypeScript, turning telemetry and workflow data into actionable visualizations.","Co-designed GraphQL query patterns and types with backend partners to provide stable, well-typed API contracts for frontend features.","Built reusable component libraries and charts, standardizing UX and improving delivery speed across internal apps.","Reduced critical-path render and network overhead via memoization, code-splitting, and caching strategies, cutting key page loads by ~30%.","Established quality gates with unit/integration tests (Jest, Cypress) and CI checks; maintained clear README and usage docs for internal adopters.","Partnered with PM/Design to scope releases, define acceptance criteria, and align priorities across conflicting requests."]},{"title":"Senior Frontend Engineer","duration":"12.2020 - 06.2025","company":"BrightLearn (Learning Platform)","location":"Remote, Warsaw, Poland","descriptions":["Led migration from legacy JS to TypeScript and modern React patterns, improving reliability and dev velocity.","Integrated GraphQL APIs and optimized state management with Redux/RTK to streamline data flows and reduce over-fetching.","Designed analytics views and data visualizations to expose learning outcomes and system health to stakeholders.","Hardened quality with Jest unit tests and Cypress E2E coverage; added performance profiling and accessibility checks (WCAG).","Introduced CI/CD for frontend builds and automated test gates; wrote component and platform documentation to improve onboarding.","Collaborated in product/design reviews, providing technical input, estimates, and trade-off recommendations."]},{"title":"Frontend Engineer","duration":"02.2020 - 11.2020","company":"EduTech Labs (Education Platform)","location":"Remote, Minsk, Belarus","descriptions":["Developed modular React components with Styled Components, improving consistency and reusability across the application.","Integrated third-party services (payments, analytics) and instrumented usage metrics for data-informed iteration.","Implemented error tracking and performance monitoring to detect regressions early and improve stability.","Contributed to testing strategy with Jest and Cypress to maintain confidence during rapid releases."]},{"title":"Frontend Software Engineer","duration":"06.2018 - 02.2020","company":"FitLife App","location":"Minsk, Belarus","descriptions":["Built frontend and a lightweight BFF layer, enabling type-safe data access and simplified client logic.","Led migration from REST to GraphQL for key features, collaborating on schema design and reducing client complexity and payload size.","Adopted micro-frontend patterns for independent module delivery and safer, incremental deployments.","Created performance and UX metrics dashboards to monitor release impact and guide optimization efforts.","Maintained automated tests (Jest) and introduced E2E coverage (Cypress) for critical user journeys."]},{"title":"Junior Frontend Engineer","duration":"08.2016 - 06.2018","company":"IoTWeb Solutions","location":"Minsk, Belarus","descriptions":["Shipped lightweight web apps in vanilla JS and Node.js, focusing on clear UI and responsive layouts.","Built dashboards that visualize device and event data, improving operator awareness and response times.","Adopted modern tooling and code hygiene practices (linting, formatting, Git workflows)."]}],"skills":{"languages":["JavaScript","TypeScript","HTML5","CSS3"],"frameworks":["React","Redux","Next.js","Node.js","GraphQL","Apollo Client","Styled Components"],"databases":["PostgreSQL","MongoDB","Redis"],"cloud_devops":["CI/CD","GitHub Actions","Docker"],"data_engineering":[],"tools_technologies":["Git","Jest","Cypress","Playwright (familiar)","Webpack","Babel","ESLint","Prettier","GraphQL tooling","Performance profiling","Accessibility (WCAG)"]},"languages":[{"name":"English","proficiency":"Fluent (C1)"},{"name":"Polish","proficiency":"Beginner (A2)"}]}